"""
邢不行｜策略分享会
选股策略框架𝓟𝓻𝓸

版权所有 ©️ 邢不行
微信: xbx1717

本代码仅供个人学习使用，未经授权不得复制、修改或用于商业用途。

Author: 邢不行
"""
import os
from pathlib import Path

from core.utils.path_kit import get_folder_path

# ====================================================================================================
# 1️⃣ 回测配置
# ====================================================================================================
# 回测数据的起始时间。如果因子使用滚动计算方法，在回测初期因子值可能为 NaN，实际的首次交易日期可能晚于这个起始时间。
start_date = '2021-01-01'
# 回测数据的结束时间。可以设为 None，表示使用最新数据；也可以指定具体日期，例如 '2024-11-01'。
end_date = None

# ====================================================================================================
# 2️⃣ 数据配置
# ====================================================================================================
data_center_path = r"E:\quantclass\treadedatas"  # 数据中心的文件夹
runtime_data_path = get_folder_path('data')  # 回测结果存放的的文件夹，默认为项目文件夹下的 data 文件夹，可以自定义

# ====================================================================================================
# 3️⃣ 策略配置
# ====================================================================================================
backtest_name = '方天画戟'  # 回测的策略组合的名称。可以自己任意取。一般建议，一个回测组，就是实盘中的一个账户。
# 策略明细
strategy_list = [
    {
        'name': '策略2',  # 策略名
        'hold_period': '3D',  # 持仓周期，W 代表周，M 代表月，还支持日频：3D、5D、10D
        'offset_list': [0],
        'select_num': 10,  # 选股数量，可以是整数，也可以是小数，比如 0.1 表示选取 10% 的股票
        'cap_weight': 1,
        "factor_list": [  # 选股因子列表
            # ** 因子格式说明 **
            # 因子名称（与 '因子库' 文件中的名称一致），排序方式（True 为升序，False 为降序），因子参数，因子权重
            # ('成交额缩量因子', True, (10, 60), 1),
            # ('成交额缩波因子', True, (10, 60), 1),
            # ('Ret', True, 5, 1),
            # ('Ret', True, 10, 1),
            # ('收盘价', True, None, 1),
            ('市值', True, None, 1),
            # ('换手率', True, 5, 1),
            # ('换手率', True, 1, 1),
            # 案例说明：使用'市值.py'因子，从小到大排序（越小越是我想要），None表示无额外参数，后面计算复合选股因子的时候权重为1
            # 可添加多个选股因子
        ],
        "filter_list": [
            # ('月份', [2], 'val:==1'),  # 只在2月份选股
            # ('市值', None, 'pct:<=0.8'),
            ('月份', [1,4], 'val:!=1'),  # 不在4月份选股
            # ('Ret', 5, 'pct:<=0.1'),
            # ('收盘价', None, 'pct:<=0.5'),
            ('换手率', 1, 'pct:<=0.8')
            # ('成交额缩量因子', (10, 60), 'pct:<=0.6',True),

        ],  # 过滤因子列表
        # ** 换仓时间 **
        # 选股日换仓的时候，我们可以自定义换仓的时间点
        # - 'close-open'：选股日收盘前卖出，交易日开盘后买入（隔日换仓）；
        # - 'open'：交易日开盘后先卖出，交易日开盘后再买入（日内早盘）；
        # - 'close'：选股日收盘前卖出，选股日收盘前再买入（日内尾盘）；
        # 默认是 'close-open'，表示收盘买，下个开盘买，即隔日换仓
        'rebalance_time': 'close',
    }
]

# 上市至今交易天数
days_listed = 250
# 整体资金使用率，也就是用于模拟的资金比例
total_cap_usage = 100 / 100  # 100%表示用全部的资金买入，如果是0.5就是使用一半的资金来模拟交易

# ====================================================================================================
# 4️⃣ 模拟交易配置
# 以下参数几乎不需要改动
# ====================================================================================================
initial_cash = 10_0000  # 初始资金10w
# initial_cash = 1_0000_0000  # 初始资金10w
# 手续费
c_rate = 1 / 10000
# 印花税
t_rate = 1 / 1000

# ====================================================================================================
# 5️⃣ 其他配置
# 以下参数几乎不需要改动
# ====================================================================================================
n_jobs = os.cpu_count() - 1

# =====参数预检查=====
runtime_folder = get_folder_path(runtime_data_path, '运行缓存')
if Path(data_center_path).exists() is False:
    print(f'数据中心路径不存在：{data_center_path}，请检查配置或联系助教，程序退出')
    exit()
