import os
from pathlib import Path
from core.utils.path_kit import get_folder_path

# ====================================================================================================
# 1️⃣ 回测配置
# ====================================================================================================
# 回测数据的起始时间。如果因子使用滚动计算方法，在回测初期因子值可能为 NaN，实际的首次交易日期可能晚于这个起始时间。
start_date = "2011-01-01"
# 回测数据的结束时间。可以设为 None，表示使用最新数据；也可以指定具体日期，例如 '2024-11-01'。
end_date = None

# ====================================================================================================
# 2️⃣ 数据配置
# ====================================================================================================
data_center_path = "/Users/Data/stock_data"  # 数据中心的文件夹
runtime_data_path = "/Users/Data/选股数据_25"  # 回测结果存放的的文件夹，默认为项目文件夹下的 data 文件夹，可以自定义

# ====================================================================================================
# 3️⃣ 策略配置
# ====================================================================================================
backtest_name = "选股策略精心随机混合"  # 回测的策略组合的名称。可以自己任意取。一般建议，一个回测组，就是实盘中的一个账户。
# 策略明细
strategy_list = [
    {
        "name": "小市值_基本面优化_定风波择时",
        "hold_period": "5D",
        "offset_list": [4],
        "select_num": 2,
        "cap_weight": 1,
        "rebalance_time": "0955-0955",
        "factor_list": [
            ("市值", True, "", 1),
            ("归母净利润同比增速", False, 60, 1),
            ("开盘至今涨幅", False, "0945", ("前100择时", 0.6)),
        ],
        "filter_list": [
            ("ROE", "单季", "pct:<=0.8", False),
            ("成交额相关因子", ("均值", 5), "val:>=5000_0000", True),
            ("收盘价", "", "val:<15", True),
        ],
    },
    {
        "name": "中等生策略_定风波择时",
        "hold_period": "5D",
        "offset_list": [4],
        "select_num": 1,
        "cap_weight": 1,
        "rebalance_time": "0955-0955",
        "factor_list": [
            ("指数相关性", False, ["sh000300", 20], 1),
            ("指数相关性", False, ["sh932000", 20], 1),
            ("指数相关性", False, ["sh000001", 20], 1),
            ("指数相关性", False, ["sh000016", 20], 1),
            ("指数相关性", False, ["sh000852", 20], 1),
            ("指数相关性", False, ["sh000905", 20], 1),
            ("指数相关性", False, ["sz399006", 20], 1),
            ("开盘至今涨幅", False, "0945", ("前100择时", 0.4)),
        ],
        "filter_list": [("收盘价", "", "val:<15", True)],
    },
    {
        "name": "低波大市值",
        "hold_period": "5D",
        "offset_list": [4],
        "select_num": 1,
        "cap_weight": 1,
        "rebalance_time": "open",
        "factor_list": [("市值", False, "", 1), ("波动率", True, 250, 1)],
        "filter_list": [("收盘价", "", "val:<15", True)],
    },
]


# 上市至今交易天数
days_listed = 250
# 整体资金使用率，也就是用于模拟的资金比例
total_cap_usage = (
    100 / 100
)  # 100%表示用全部的资金买入，如果是0.5就是使用一半的资金来模拟交易

# ====================================================================================================
# 4️⃣ 模拟交易配置
# 以下参数几乎不需要改动
# ====================================================================================================
initial_cash = 10_0000  # 初始资金10w
# 手续费
c_rate = 1.2 / 10000
# 印花税
t_rate = 1 / 1000

# ====================================================================================================
# 5️⃣ 其他配置
# 以下参数几乎不需要改动
# ====================================================================================================
n_jobs = os.cpu_count() - 1

# =====参数预检查=====
runtime_folder = get_folder_path(runtime_data_path, "运行缓存")
if Path(data_center_path).exists() is False:
    print(f"数据中心路径不存在：", data_center_path, "请检查配置或联系助教，程序退出")
    exit()
